podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FLEXIO0_MK82F25615.svd.xml
<!--
Devices using this peripheral: 
      MK82F25615
-->
      <peripheral>
         <?sourceFile "FLEXIO0_MK82F25615" ?>
         <name>FLEXIO</name>
         <description>The FLEXIO Memory Map/Register Definition can be found here</description>
         <groupName>FLEXIO</groupName>
         <prependToName>FLEXIO</prependToName>
         <headerStructName>FLEXIO</headerStructName>
         <baseAddress>0x400DF000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x1C</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x20</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x30</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x40</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x80</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x200</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x280</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x300</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x380</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x400</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x480</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x500</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x680</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x700</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x780</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>VERID</name>
               <description>Version ID Register</description>
               <addressOffset>0x0</addressOffset>
               <access>read-only</access>
               <resetValue>0x1010001</resetValue>
               <fields>
                  <field>
                     <name>FEATURE</name>
                     <description>Feature Specification Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Standard features implemented</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Supports state, logic and parallel modes</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MINOR</name>
                     <description>Minor Version Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAJOR</name>
                     <description>Major Version Number</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PARAM</name>
               <description>Parameter Register</description>
               <addressOffset>0x4</addressOffset>
               <access>read-only</access>
               <resetValue>0x10200808</resetValue>
               <fields>
                  <field>
                     <name>SHIFTER</name>
                     <description>Shifter Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TIMER</name>
                     <description>Timer Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PIN</name>
                     <description>Pin Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TRIGGER</name>
                     <description>Trigger Number</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL</name>
               <description>FlexIO Control Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>FLEXEN</name>
                     <description>FlexIO Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FlexIO module is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FlexIO module is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Software reset is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Software reset is enabled, all FlexIO registers except the Control Register are reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FASTACC</name>
                     <description>Fast Access</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Configures for normal register accesses to FlexIO</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Configures for fast register accesses to FlexIO</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBGE</name>
                     <description>Debug Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FlexIO is disabled in debug modes</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FlexIO is enabled in debug modes</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DOZEN</name>
                     <description>Doze Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FlexIO enabled in Doze modes</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FlexIO disabled in Doze modes</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIN</name>
               <description>Pin State Register</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PDI</name>
                     <description>Pin Data Input</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTSTAT</name>
               <description>Shifter Status Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>SSF</name>
                     <description>Shifter Status Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Status flag is clear</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Status flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTERR</name>
               <description>Shifter Error Register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>SEF</name>
                     <description>Shifter Error Flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Shifter Error Flag is clear</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Shifter Error Flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMSTAT</name>
               <description>Timer Status Register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>TSF</name>
                     <description>Timer Status Flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Timer Status Flag is clear</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Timer Status Flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTSIEN</name>
               <description>Shifter Status Interrupt Enable</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>SSIE</name>
                     <description>Shifter Status Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Shifter Status Flag interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Shifter Status Flag interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTEIEN</name>
               <description>Shifter Error Interrupt Enable</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>SEIE</name>
                     <description>Shifter Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Shifter Error Flag interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Shifter Error Flag interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMIEN</name>
               <description>Timer Interrupt Enable Register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>TEIE</name>
                     <description>Timer Status Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Timer Status Flag interrupt is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Timer Status Flag interrupt is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTSDEN</name>
               <description>Shifter Status DMA Enable</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>SSDE</name>
                     <description>Shifter Status DMA Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Shifter Status Flag DMA request is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Shifter Status Flag DMA request is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTSTATE</name>
               <description>Shifter State Register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>STATE</name>
                     <description>Current State Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
